Failed to rename the user:
```
resource "opennebula_group" "group" {
  name                  = "test1"  

  sunstone {
    default_view             = "ig1_customers" 
    group_admin_default_view = "ig1_admin_priv_cloud" 
    group_admin_views        = "ig1_admin_priv_cloud" 
    views                    = "ig1_customers" 
  }

  lifecycle {
    ignore_changes = [
      template,
    ]
  }
}

resource "opennebula_user" "user2" {
  name          = "test5"
  groups = [opennebula_group.group.id]
  password      = "testpwd"
  auth_driver   = "core"
  primary_group = opennebula_group.group.id
}

resource "opennebula_group_admins" "example" {
  group_id = opennebula_group.group.id
  users_ids = [
    opennebula_user.user2.id
  ]
}
```

Apply step:
```
Terraform will perform the following actions:

  # opennebula_group_admins.example will be updated in-place
  ~ resource "opennebula_group_admins" "example" {
        id        = "191"
      ~ users_ids = [
          - 110,
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # opennebula_user.user2 must be replaced
-/+ resource "opennebula_user" "user2" {
      ~ default_tags  = {} -> (known after apply)
      ~ id            = "110" -> (known after apply)
      ~ name          = "test2" -> "test5" # forces replacement
      ~ tags_all      = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on terraform.tf line 1360, in resource "opennebula_group" "group":
│ 1360:       template,
│ 
│ The attribute "template" is deprecated. Refer to the provider documentation for details.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opennebula_user.user2: Destroying... [id=110]
opennebula_user.user2: Destruction complete after 0s
opennebula_user.user2: Creating...
opennebula_user.user2: Creation complete after 0s [id=111]
opennebula_group_admins.example: Modifying... [id=191]
╷
│ Error: Failed to delete a group admin
│ 
│   with opennebula_group_admins.example,
│   on terraform.tf line 1381, in resource "opennebula_group_admins" "example":
│ 1381: resource "opennebula_group_admins" "example" {
│ 
│ group (ID: 191): OpenNebula error [NO_EXISTS]: [one.group.deladmin] Error getting user [110].
```

It seems that the group admin resource try to delete the user from it's list but failed because the user doen't exists anymore